-- phpMyAdmin SQL Dump
-- version 4.7.4
-- https://www.phpmyadmin.net/
--
-- 主機: 127.0.0.1:3306
-- 產生時間： 2018-06-01 11:50:17
-- 伺服器版本: 5.7.19
-- PHP 版本： 5.6.31

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `group9_db`
--

-- --------------------------------------------------------

--
-- 資料表結構 `menu`
--

DROP TABLE IF EXISTS `menu`;
CREATE TABLE IF NOT EXISTS `menu` (
  `mrid` varchar(100) NOT NULL,
  `mid` int(100) NOT NULL AUTO_INCREMENT,
  `mname` varchar(100) NOT NULL,
  `mprice` int(100) NOT NULL,
  `mintro` varchar(100) NOT NULL,
  `mveg` varchar(100) NOT NULL,
  `mcal` int(100) NOT NULL,
  PRIMARY KEY (`mid`)
) ENGINE=MyISAM AUTO_INCREMENT=30426 DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `menu`
--

INSERT INTO `menu` (`mrid`, `mid`, `mname`, `mprice`, `mintro`, `mveg`, `mcal`) VALUES
('208', 1, 'Brand Guotie ', 5, 'Fresh popsticles\r\nZhaopai guotie\r\n', '0', 64),
('208', 6, 'Brand Dumplings', 5, 'delicious brand dumplinigs', '0', 70),
('208', 2, 'Leek dumplings', 5, 'Leek dumplings\r\nTender and crispy pork served with hand-picked pork, which is unforgettable.', '0', 60),
('208', 4, 'Korean spicy popsticles', 5, 'delicious korean popsticles', '0', 70),
('208', 5, 'Golden Curry popsticles', 5, 'delicious curry popsticles', '0', 75),
('208', 3, 'JioTsai Dumpling', 5, 'Delicious JioTsai Dumplings', '0', 40),
('208', 7, 'Bubble milktea', 50, 'delivious bubbletea, tasty!! yay', '1', 500),
('208', 8, 'Sour spicy soup 酸辣湯', 50, 'delicious soup', '1', 300),
('101', 1010, '牛肉河粉', 70, '好吃的牛肉河粉', '0', 350),
('102', 1020, '玉米蛋餅', 40, '好吃的玉米蛋餅', '1', 200),
('103', 1030, '鴨肉飯', 85, '好吃的鴨肉飯，推!', '0', 500),
('103', 1031, '油雞飯', 75, '經典油雞飯', '0', 700),
('104', 1040, '牛肉炒泡麵', 65, '好吃的牛肉炒泡麵，大大的滿足', '0', 800),
('104', 1041, '豬肉炒烏龍', 65, '料好實在的豬肉炒烏龍', '0', 850),
('105', 1050, '豬肉壽喜飯', 70, '好吃的壽喜飯呦', '0', 782),
('106', 1060, '巧克力牛奶', 25, '好喝的巧克力牛奶，搭配早餐最適合', '1', 300),
('106', 1061, '藍莓貝果', 35, '好吃的早餐哦', '1', 260),
('201', 2010, '柳橙汁', 35, '柳橙果汁真好喝~', '1', 180),
('201', 2011, 'FIN運動飲料', 22, '就是運動飲料', '1', 80),
('202', 2020, '蔥抓餅', 35, '就是個蔥抓餅。', '1', 500),
('202', 2021, '荷包蛋', 10, 'delicious egg', '1', 50),
('202', 2022, '紅茶', 15, '就是早餐紅茶', '1', 60),
('203', 2030, '蒜泥白肉飯', 65, 'I\'m 蒜泥白肉飯 please eat me.', '0', 800),
('204', 2040, '珍珠奶茶', 45, '珍珠奶茶真好喝', '1', 400),
('205', 2050, '套餐1', 70, '王子麵加多種料', '0', 800),
('205', 2051, '炒豬肉烏龍麵', 70, '炒豬肉烏龍麵，好吃~', '0', 800),
('206', 2060, '雞腿飯', 85, '好吃的現炸雞腿飯。', '0', 1000),
('207', 2070, '德式臘腸斜管麵', 90, '德式臘腸斜管麵好ㄘ喔', '0', 896),
('209', 2090, '韓式拌飯', 75, '韓式拌飯真好吃', '0', 900),
('210', 2100, '炸豬排蛋包飯', 75, '好吃的蛋包飯', '0', 1000),
('210', 2101, '雞排蛋包飯', 80, '很好吃的雞排蛋包飯', '0', 950),
('211', 2110, '五穀飯', 15, '健康的飯', '1', 300),
('212', 2120, '木瓜牛奶', 50, '健康好喝的飲料', '1', 300),
('212', 2121, '芋園仙草', 40, '好吃的芋園仙草，最適合炎炎夏日', '1', 400),
('213', 2130, '客家粄條', 40, '好吃的客家粄條', '0', 500),
('213', 2131, '乾麵', 40, '乾麵很好吃歐', '0', 450),
('213', 2132, '餛飩湯', 40, '餛飩湯很讚哦~', '0', 600),
('214', 2140, '肉醬義大利麵', 80, '還不錯吃的肉醬義大利麵', '0', 800),
('214', 2141, '炸薯條', 35, '很好吃的炸薯條，大推', '1', 770),
('215', 2150, '雞腿便當', 50, '便宜不錯吃的自助餐', '0', 805),
('302', 3020, '芭樂蘋果汁', 40, '健康好喝的芭樂蘋果汁', '1', 252),
('302', 3021, '西瓜汁', 30, '清涼好喝的西瓜汁', '1', 250),
('303', 3030, '滿分早餐', 60, '一定吃飽的早餐套餐', '0', 800),
('303', 3031, '奶茶', 20, '早餐店奶茶', '1', 500),
('304', 3040, '元氣雞腿', 75, '就是雞腿便當', '0', 950),
('305', 3050, 'A套餐', 65, '王子麵加火鍋料', '0', 800),
('306', 3060, '豬腳便當', 70, '好吃的豬腳便當~', '0', 1100),
('307', 3070, '珍珠紅茶拿鐵', 60, '就是珍珠鮮奶茶', '1', 550),
('308', 3080, '養身豬肉鍋', 65, '養身豬肉鍋，可以自選主食哦', '0', 760),
('309', 3090, '韭菜水餃', 5, '就是韭菜水餃', '0', 60),
('310', 3100, '酷繽沙', 49, '冰冰涼涼的酷繽沙，好喝', '1', 460),
('311', 3110, '大麥克單點', 69, '經典大麥克', '0', 800),
('311', 3111, '大薯', 45, '麥當勞薯條', '1', 680),
('304', 3041, '元氣丼(親子雞肉)', 70, '選擇障礙的就吃這個吧', '0', 600),
('304', 3042, '招牌丼(照燒豬肉)', 70, '是招牌喔', '0', 604),
('304', 3043, '活力丼(照燒牛肉)', 75, '吃完就有活力', '0', 650),
('304', 3044, '酥炸豬排', 70, '鮮嫩多汁好好吃', '0', 704),
('304', 3045, '蔥燒滷排', 70, '最滷的那種', '0', 698),
('304', 3046, '酥炸鮮蝦', 65, '好吃的蝦蝦', '0', 645),
('304', 3047, '香蒜牛肉', 65, '蒜香最讚', '0', 670),
('304', 3048, '椒鹽雞排', 80, '椒鹽雞排讚讚', '0', 798),
('304', 3049, '椒麻雞排', 80, '會辣喔要注意', '0', 805),
('304', 30410, '咖哩雞排', 80, '咖哩控照過來', '0', 861),
('304', 30411, '醬燒獅子頭', 65, '獅子頭厲害吧', '0', 745),
('304', 30412, '藍帶豬排', 60, '豬排+起士', '0', 768),
('304', 30413, '香菇滑雞', 60, '香菇滑雞小心會滑', '0', 693),
('304', 30414, '麻油滑雞', 60, '麻油滑雞一樣會滑', '0', 812),
('304', 30415, '五香滷肉', 60, '還是滷肉最對味', '0', 741),
('304', 30416, '蒜泥白肉', 60, '經典的美味', '0', 794),
('304', 30417, '宮保雞丁', 60, '都說是宮保雞丁了 還需要想嗎', '0', 750),
('304', 30418, '薑絲豬肉', 60, '愛吃薑的人請進', '0', 602),
('304', 30419, '醣醋雞丁', 60, '酸酸甜甜好滋味', '0', 746),
('304', 30420, '金沙雞丁', 60, '金沙是鹹蛋喔', '0', 623),
('304', 30421, '蔥爆豬柳', 60, '蔥爆豬柳好好吃', '0', 639),
('304', 30422, '簡餐(3菜)', 45, '簡單的餐', '1', 412),
('304', 30423, '簡餐(4菜)', 50, '簡單的餐', '1', 489),
('304', 30424, '香煎腿排', 85, '最貴最好吃', '0', 832),
('304', 30425, '香煎鯖魚', 70, '魚魚好營養', '0', 716),
('105', 1051, '控肉飯', 75, '肥瘦剛好的控肉', '0', 806),
('105', 1052, '滷豬排飯', 75, '滷的最對味', '0', 847),
('105', 1053, '香酥豬排飯', 75, '好吃的香酥豬排飯', '0', 790),
('105', 1054, '香腸飯', 75, '愛吃香腸的照過來', '0', 698),
('105', 1055, '黃金鱈魚飯', 80, '美味的鱈魚', '0', 746),
('105', 1056, '左宗棠雞飯', 80, '吃完變左宗棠', '0', 705),
('105', 1057, '香煎雞腿飯', 80, '嗯就是雞腿飯', '0', 809),
('105', 1058, '椒麻雞腿飯', 80, '會辣的雞腿飯喔', '0', 829),
('105', 1059, '三杯雞飯', 80, '三杯雞好下飯', '0', 760),
('105', 10510, '麻油雞飯', 80, '麻油雞飯好好吃', '0', 819),
('105', 10511, '泰式雞腿飯', 80, '泰式好滋味', '0', 860),
('105', 10512, '紅燒牛腩飯', 90, '紅燒牛腩!!!', '0', 843),
('105', 10513, '蘋果汁土魠魚飯', 90, '蘋果尬土魠魚蹦出新滋味', '0', 807),
('207', 2071, '煙燻培根螺絲麵', 90, '煙燻培根螺絲麵吃完講話吃螺絲', '0', 925),
('207', 2072, '奶油海鮮義大利麵', 90, '濃郁奶油搭配美味海鮮', '0', 905),
('207', 2073, '義大利肉醬麵', 70, '經典口味', '0', 745),
('207', 2074, '泡菜牛肉丼飯', 90, '韓式口味讚讚', '0', 547),
('207', 2075, '叻沙紅咖哩雞飯', 90, '馬來西亞美食', '0', 748),
('207', 2076, '炸豬排咖哩飯', 80, '鮮嫩多汁炸豬排', '0', 785),
('207', 2077, '土耳其雞肉捲', 60, '輕食好選擇', '0', 390),
('207', 2078, '蔬菜牛肉堡', 60, '牛肉堡好好吃', '0', 450),
('207', 2079, '勁辣雞腿堡', 45, '勁辣好過癮', '0', 665),
('207', 20710, '加拿大脆薯', 30, '金黃酥脆好吃\r\n', '1', 375),
('207', 20711, '麥克雞塊', 30, '雞塊讚讚', '0', 170),
('207', 20712, '香蒜麵包', 20, '吃完滿嘴大蒜味', '1', 102),
('207', 20713, '檸檬紅茶', 10, '搭配餐點優惠', '1', 20),
('207', 20714, '茉香綠茶', 10, '搭配餐點優惠', '1', 8),
('207', 20715, '特調冰咖啡', 25, '搭配餐點優惠', '1', 25),
('207', 20716, '蔓越莓果醋', 25, '搭配餐點優惠', '1', 23),
('207', 20717, '可口可樂', 15, '搭配餐點優惠', '1', 31),
('207', 20718, '玉米濃湯', 20, '搭配餐點優惠', '0', 89);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
